//
//  GraduationArticle.swift
//  HappyGraduation
//
//  Created by Andy Lin on 2024/7/2.
//

import Foundation

class GraduationArticle {
    static let article = """
接下來的內容有點多，如果可以的話，找個能一次看完的時間唄。然後，我先為遲到的事情道歉，對不起ㄏㄚ ：）專案爛掉，整個開不起來，開完之後git不知道為什麼也爛了，明明我之前甚至完全沒動過這個專案，然後更慘的是，還有那個檔案直接不見的 ＝＝ 煩都煩死了。好ㄉ，正文開始

ㄏㄟˋ 你知道嗎？我們畢業了欸，解脫土撥鼠的掌控了:D

上次更新這個app，是在會考前一個月，因為你的一句話：「欸你去更新一下那個app啦，在我們不講話之前都更新一下嘛」我就開始埋頭苦幹，寫長文，想新玩法，做新玩法，結果你在會考當天才更新 ：）會考倒數、會考前的彩蛋、會考當天會發送的訊息，這些東西都錯過了，也是 挺猛。說實話我覺得蠻不被尊重的
:D
好吧你好像也沒有逼我 隨便啦

ㄜˊ 怎麼寫那種很有意境的長文啊 做不到 :D

好，就把我們在這段時間內的經歷都講講好了

從我們認識的時候說起，回到那個，兩兩認識，但又對各自留有厚厚面紗的時候。那天是考中檢的日子，那時我坐在你前面，你後面是辛宥樂，好像是數學課的樣子（不然好像也沒機會可以一直講話），那時候你突然說：「啊！我沒帶證件！完蛋了啦等一下要考中檢，怎麼辦我媽也沒辦法送我的證件過來」然後我就一直轉頭過去跟你講話，這時候我們都還沒有很熟，甚至整個國一都過去了還講不到10句話，但也因為這件事，開啟了後面一年半的事情
（拜託 國一那個尷尬的黑歷史我不想回憶）

那時候我們還不熟，校車上也是比較多在講話的時候，你跟我們坐到前面，開始講班上的大小事，最多聽到的就是18又怎樣又怎樣了，也是從那時候開始，我們也變得比較常講話

時間來到了2023/3/2晚上9. 那天你突然發了三句「香菇、香菇、香菇，這人怪怪的」
然後附上兩張照片，分別是自信🈹說：「你emo喔」 「我來安慰你」，我不知道為什麼你會跟我講，但從那時候開始，我們才比較常在訊息聊天了

後來，你的考試考差了，家裡給的一坨壓力，對自己學習的成果不如預想，感覺家人的付出和自己的成果不成正比，對於理化、數學的無力感，讓你一次次的崩潰，也跑來找我訴苦，半夜1、2.的emo也變成那時候的日常

也是在一個稀鬆平常的夜晚，你突然傳訊息「香菇 這題怎麼寫 問5個人了他們都不會」 從這個奇怪的問題開始，你就開始問我一堆理化問題，我還幫你整理筆記ㄟ
雖然你好像沒在看 :D

接下來，童軍露營近在眼前，為了練舞和班導起爭執，為了出演努力準備，然後前一天還跟我討我跟10的聊天記錄
💩❓
到了童軍露營當天，每個人都滿心期待，我也不例外，期待的是童軍「露營」，但一下車 教官就讓我們知道是童「軍」露營
「拔掉你的口罩」、「綁好你的水壺」、「等一下就給我大聲喊，喊到你們燒聲為止」 結果我都動嘴巴而已 :D  接下來到了晚上，每個班開始唱歌，這時候才意識到，原來這隻蛇人也沒有很差，該玩的也會讓我們玩。到了我們上台的時候，我跟你還在打賭 ：猜拳輸的下去拉教官上來唱歌，結果老師說了不能這樣  ：（  但上台後大家還是玩得很開心，該唱歌的唱歌，跳舞的跳舞，連舞台都被跳到在震動，雖然沒得名，但玩得真的很開心 :D 後來洗澡的時候，小公主的水管爆了，還影響到你 有夠雖：） 而且我還跟你借乾洗髮，第二天你拿到的時候，你：・ࡇ・「怎麼少那麼多？」  相當抱歉...😦
然後到了第二天，那隻蛇突然對我們超好，路隊有排就行，課有上就好，我還懷疑他是不是吃錯藥:D
好啦，重點還是在晚上，營火晚會，你上去跳舞，本來還要戴那個像素眼鏡
啊結果後來沒有💩 反正下台之後也是玩很瘋。然後接下來就是蠟燭 許願。我那時候許什麼，我好像也忘ㄌ💩
最後一天烤肉的時候，我們組的火一直升不起來，我還跑去你們那邊拿你們吃剩的:D 反正是挺可憐的就是

接下來到了4月，你還是覺得自信🈹很煩，我也不知道那時候哪來的勇氣，就創了一個帳號去搞他:D 也就是人見人愛的婷涵。一開始我去玩牠，我以為要很久，搞不好還不會成功，結果他23小時就上鉤了😦你還寫小說ㄟ。然後創完帳號，我跟你一直在那邊玩顏文字，還變成我用一堆表符改不回來，還有一個，4/16 我在墾丁，他在那裡發情，晚上你在教歷史，我人不在家，甚至沒辦法找到課本，虧我那時候還有帶回家欸：（ 但我有做筆記👌🏻看我多認真啊。而且那時候你說要電話的時候我有嚇到，我那還是第一次跟女生講電話💩在這件事之後我跟你就都用婷涵的帳號聊天了。欸而且，後來不是我自己會怕，然後就跟他分了嗎，超好笑俗辣一個✅

好吧  5月我也想不起來有什麼比較大的事，大概就考試ㄅ，直接跳到六月唄，那時候剛放暑假，耳環事件💩💩💩整個暑假都沒講幾句話，然後倒暑輔的時候，我真的很EY你會跟我講話😦好反正，之後應該是有和好很多了
吧
:D

10月底時學校舉辦校慶運動會，你幫辛綁頭髮，我還幫你拍一張眼睛ㄆㄧㄚˊ掉的照片 :D
然後那時候好像沒有什麼交集，我跟你拍的照片也沒給我

然後接下來是11月的畢旅，我那時候還說要女裝，你跟蔡聿庭還有陳家霈都超積極要給我穿，連真理褲、百褶裙都出來了，但後面我還是沒穿:D  好然後，大家都滿懷期待的出遊，我那天還睡不著，早上一點多才睡著。然後ㄤ，第一天去六福村，吳季詡跟辛宥樂還在那邊一直滑滑步，而且你的項鍊還被王芊婷弄到我手上，我超ㄘㄨㄚˋ  超怕弄不見，還好後面有找到你 ：）  晚上的時候去夜市，你穿楊永仲外套確實是挺猛。然後集合的時候我還拿一支超大的煙，跟教官拍照，萬一峰在超奇怪的地方躲著 跟鬼一樣。然後晚上的時候，3班還有人打電話跟你晚安接下來就變我打給你（💩❓  然後在那裡用google翻譯讓他講話，好玩
隔天的行程，好像也沒什麼交集，但晚上的時候大家都唱歌唱得很開心，還有辛宥樂，擦玻璃🈹 。下車之後，在路上跳舞跳了一個小時，辛、吳在滑步，後來去旁邊的寶雅之類的東西，咱們寬哥還來找你(⁎⁍̴̛ᴗ⁍̴̛⁎)，真是深情，然後當天晚上玩了真心話大冒險線上版，我沒被放進轉盤超久，到要結束了你們才發現 :D
第三天的景點，先去不知道叫什麼的地方，然後拍了那個轉圈圈
接下來到鹿港老街，在那個巷子裡，玩了超久，欸那三天，真的超好玩

一樣是11月，那時候音樂課要表演，我帶一堆螢光棒，結果校車上被拆來玩，玩得超瘋，還有張庭勛在上香
那天應該是三年來校車上玩最瘋的一天

到12月 我生日前一天，你在手上用簽字筆寫生辰快樂 超好笑，張庭勛的腿還遭殃
接下來是我的生日，相當的重要，然後是我的生日禮物，那個手機殼，沒講完的生日賀卡，一疊香菇便利貼，欸這個我到現在都還沒用💩，還有幾張手繪
我超感動，少數的生日禮物😦

好的
轉眼間，時間就來到2024，會考的壓力也愈來愈大。你：敷衍 塑膠 不理人🙂
糟糕至極💩💩

接下來是2月 放寒假，一樣消失，但不一樣的是你要生日了，作為這麼好的同學當然是要幫你準備禮物，絕對是這樣的對吧 不存在什麼回禮的，那時候我想超久，我完全不知道送你什麼
「雖然說你給我的大概100以內，但感覺太敷衍也不好，吼到底要送什麼啦」
然後我也忘記為什麼會想到送這個，反正那時候我想到要做的時候已經剩下15天了，再加上要寫稿 要做玩法 要藏彩蛋 要學新東西，我本來還預計要提前5天給你
所以那時候真的超趕。ㄞ反正，之後是做出來的對吧
但會考前的更新是有點可憐就是了💩
接下來過完寒假，會考剩最後100天了，變成快死了的會考牲 🤡

然後啊 三月 四月 好像沒有什麼東西。喔對 你有做畢冊欸，好看
雖然中間幹事聽說挺多 但好看 :D
五月，我也不知道有什麼，後來就會考了，會考那兩天，應該也是沒發生什麼，就是中午很難睡而已 :D 如果有應該是我忘了而已

後來會考完，大家都在玩手機 看電影 玩桌遊，說實在挺空虛的💩反正我是沒想到會考後會那麼無聊，然後不知不覺 就要畢業了
紅樓夢結束的那一刻 畢業紀念冊發下的那一刻，彷彿都在向我們說「能和同學相處的時間不多了，最後的這一點時光，好好珍惜」

雖然說 跟你認識了那麼久（小一開始？
真正熟的時間也從國二開始而已。半夜的一某、校車上的八卦、為了一些無謂的事情爭吵到半夜2.，這些點點滴滴，即使上了高中、大學，也會永存於我的心中（吧
現在看回之前的各種回憶，不管是開心、生氣，亦或是尷尬、厭惡，都是這段友誼中不可或缺的元素，我們之間的感情，我很喜歡
一起發瘋、一起打鬧，一起玩螢光棒、一起面對情緒，一起學習、一起玩你畫我猜，一起討論價值觀、一起在學校度過最後的時光，最後一起畢業，一切的一切都是那麼寶貴，卻又走得那麼快

認識你的這兩年，被大大小小的回憶填滿，也正因如此，這段友誼顯得格外珍貴，奈何時間不曾為誰停下腳步，再要好的朋友、再珍貴的友誼，在時間的面前不值一提，但也希望能在畢業後繼續一如既往地聯絡，不被地緣限制，不被時間支配，隨心所欲的聊天

畢業快樂，或許會考成績不盡理想，但成績並不代表一個人的成敗，希望你能在這之後，仍能保持現在這份心情，積極的面對每個挑戰，能夠面對自己的情緒

這段友誼，在我心中永遠保有一席之地，不論時間過了多久，這兩年發生的事情，是最讓我印象深刻，也讓我想好好保存在心中的，也希望之後我們都能在各自開闢的道路上，發光發熱。

最後，期望你能在喜愛的、擅長的事物上，找到自己的一席之地

學校將我們聚再一起，又將我們殘酷的打散，但或許幾年後的某天，你會偶然間想起我們在這段時間所經歷的，會再次點開這個程式，看看那時候的我們，到了那時候的我，是什麼樣的人呢？到了那時候的你，又會是什麼樣的人呢？

那就
先醬子唄
畢業快樂
🎓


24.6.16  香菇

"""
    
    static let articleOptimization: [String] = [
"""
接下來的內容有點多，如果可以的話，找個能一次看完的時間唄。然後，我先為遲到的事情道歉，對不起ㄏㄚ ：）專案爛掉，整個開不起來，開完之後git不知道為什麼也爛了，明明我之前甚至完全沒動過這個專案，然後更慘的是，還有那個檔案直接不見的 ＝＝ 煩都煩死了。好ㄉ，正文開始

ㄏㄟˋ 你知道嗎？我們畢業了欸，解脫土撥鼠的掌控了:D

上次更新這個app，是在會考前一個月，因為你的一句話：「欸你去更新一下那個app啦，在我們不講話之前都更新一下嘛」我就開始埋頭苦幹，寫長文，想新玩法，做新玩法，結果你在會考當天才更新 ：）會考倒數、會考前的彩蛋、會考當天會發送的訊息，這些東西都錯過了，也是 挺猛。說實話我覺得蠻不被尊重的
:D
好吧你好像也沒有逼我 隨便啦

ㄜˊ 怎麼寫那種很有意境的長文啊 做不到 :D

好，就把我們在這段時間內的經歷都講講好了

從我們認識的時候說起，回到那個，兩兩認識，但又對各自留有厚厚面紗的時候。那天是考中檢的日子，那時我坐在你前面，你後面是辛宥樂，好像是數學課的樣子（不然好像也沒機會可以一直講話），那時候你突然說：「啊！我沒帶證件！完蛋了啦等一下要考中檢，怎麼辦我媽也沒辦法送我的證件過來」然後我就一直轉頭過去跟你講話，這時候我們都還沒有很熟，甚至整個國一都過去了還講不到10句話，但也因為這件事，開啟了後面一年半的事情
（拜託 國一那個尷尬的黑歷史我不想回憶）
""",
"""
那時候我們還不熟，校車上也是比較多在講話的時候，你跟我們坐到前面，開始講班上的大小事，最多聽到的就是18又怎樣又怎樣了，也是從那時候開始，我們也變得比較常講話

時間來到了2023/3/2晚上9. 那天你突然發了三句「香菇、香菇、香菇，這人怪怪的」
然後附上兩張照片，分別是自信🈹說：「你emo喔」 「我來安慰你」，我不知道為什麼你會跟我講，但從那時候開始，我們才比較常在訊息聊天了

後來，你的考試考差了，家裡給的一坨壓力，對自己學習的成果不如預想，感覺家人的付出和自己的成果不成正比，對於理化、數學的無力感，讓你一次次的崩潰，也跑來找我訴苦，半夜1、2.的emo也變成那時候的日常

也是在一個稀鬆平常的夜晚，你突然傳訊息「香菇 這題怎麼寫 問5個人了他們都不會」 從這個奇怪的問題開始，你就開始問我一堆理化問題，我還幫你整理筆記ㄟ
雖然你好像沒在看 :D

接下來，童軍露營近在眼前，為了練舞和班導起爭執，為了出演努力準備，然後前一天還跟我討我跟10的聊天記錄
💩❓
到了童軍露營當天，每個人都滿心期待，我也不例外，期待的是童軍「露營」，但一下車 教官就讓我們知道是童「軍」露營
「拔掉你的口罩」、「綁好你的水壺」、「等一下就給我大聲喊，喊到你們燒聲為止」 結果我都動嘴巴而已 :D  接下來到了晚上，每個班開始唱歌，這時候才意識到，原來這隻蛇人也沒有很差，該玩的也會讓我們玩。到了我們上台的時候，我跟你還在打賭 ：猜拳輸的下去拉教官上來唱歌，結果老師說了不能這樣  ：（  但上台後大家還是玩得很開心，該唱歌的唱歌，跳舞的跳舞，連舞台都被跳到在震動，雖然沒得名，但玩得真的很開心 :D 後來洗澡的時候，小公主的水管爆了，還影響到你 有夠雖：） 而且我還跟你借乾洗髮，第二天你拿到的時候，你：・ࡇ・「怎麼少那麼多？」  相當抱歉...😦
然後到了第二天，那隻蛇突然對我們超好，路隊有排就行，課有上就好，我還懷疑他是不是吃錯藥:D
好啦，重點還是在晚上，營火晚會，你上去跳舞，本來還要戴那個像素眼鏡
啊結果後來沒有💩 反正下台之後也是玩很瘋。然後接下來就是蠟燭 許願。我那時候許什麼，我好像也忘ㄌ💩
最後一天烤肉的時候，我們組的火一直升不起來，我還跑去你們那邊拿你們吃剩的:D 反正是挺可憐的就是
""",
"""
接下來到了4月，你還是覺得自信🈹很煩，我也不知道那時候哪來的勇氣，就創了一個帳號去搞他:D 也就是人見人愛的婷涵。一開始我去玩牠，我以為要很久，搞不好還不會成功，結果他23小時就上鉤了😦你還寫小說ㄟ。然後創完帳號，我跟你一直在那邊玩顏文字，還變成我用一堆表符改不回來，還有一個，4/16 我在墾丁，他在那裡發情，晚上你在教歷史，我人不在家，甚至沒辦法找到課本，虧我那時候還有帶回家欸：（ 但我有做筆記👌🏻看我多認真啊。而且那時候你說要電話的時候我有嚇到，我那還是第一次跟女生講電話💩在這件事之後我跟你就都用婷涵的帳號聊天了。欸而且，後來不是我自己會怕，然後就跟他分了嗎，超好笑俗辣一個✅

好吧  5月我也想不起來有什麼比較大的事，大概就考試ㄅ，直接跳到六月唄，那時候剛放暑假，耳環事件💩💩💩整個暑假都沒講幾句話，然後倒暑輔的時候，我真的很EY你會跟我講話😦好反正，之後應該是有和好很多了
吧
:D

10月底時學校舉辦校慶運動會，你幫辛綁頭髮，我還幫你拍一張眼睛ㄆㄧㄚˊ掉的照片 :D
然後那時候好像沒有什麼交集，我跟你拍的照片也沒給我

然後接下來是11月的畢旅，我那時候還說要女裝，你跟蔡聿庭還有陳家霈都超積極要給我穿，連真理褲、百褶裙都出來了，但後面我還是沒穿:D  好然後，大家都滿懷期待的出遊，我那天還睡不著，早上一點多才睡著。然後ㄤ，第一天去六福村，吳季詡跟辛宥樂還在那邊一直滑滑步，而且你的項鍊還被王芊婷弄到我手上，我超ㄘㄨㄚˋ  超怕弄不見，還好後面有找到你 ：）  晚上的時候去夜市，你穿楊永仲外套確實是挺猛。然後集合的時候我還拿一支超大的煙，跟教官拍照，萬一峰在超奇怪的地方躲著 跟鬼一樣。然後晚上的時候，3班還有人打電話跟你晚安接下來就變我打給你（💩❓  然後在那裡用google翻譯讓他講話，好玩
隔天的行程，好像也沒什麼交集，但晚上的時候大家都唱歌唱得很開心，還有辛宥樂，擦玻璃🈹 。下車之後，在路上跳舞跳了一個小時，辛、吳在滑步，後來去旁邊的寶雅之類的東西，咱們寬哥還來找你(⁎⁍̴̛ᴗ⁍̴̛⁎)，真是深情，然後當天晚上玩了真心話大冒險線上版，我沒被放進轉盤超久，到要結束了你們才發現 :D
第三天的景點，先去不知道叫什麼的地方，然後拍了那個轉圈圈
接下來到鹿港老街，在那個巷子裡，玩了超久，欸那三天，真的超好玩
""",
"""
一樣是11月，那時候音樂課要表演，我帶一堆螢光棒，結果校車上被拆來玩，玩得超瘋，還有張庭勛在上香
那天應該是三年來校車上玩最瘋的一天

到12月 我生日前一天，你在手上用簽字筆寫生辰快樂 超好笑，張庭勛的腿還遭殃
接下來是我的生日，相當的重要，然後是我的生日禮物，那個手機殼，沒講完的生日賀卡，一疊香菇便利貼，欸這個我到現在都還沒用💩，還有幾張手繪
我超感動，少數的生日禮物😦

好的
轉眼間，時間就來到2024，會考的壓力也愈來愈大。你：敷衍 塑膠 不理人🙂
糟糕至極💩💩

接下來是2月 放寒假，一樣消失，但不一樣的是你要生日了，作為這麼好的同學當然是要幫你準備禮物，絕對是這樣的對吧 不存在什麼回禮的，那時候我想超久，我完全不知道送你什麼
「雖然說你給我的大概100以內，但感覺太敷衍也不好，吼到底要送什麼啦」
然後我也忘記為什麼會想到送這個，反正那時候我想到要做的時候已經剩下15天了，再加上要寫稿 要做玩法 要藏彩蛋 要學新東西，我本來還預計要提前5天給你
所以那時候真的超趕。ㄞ反正，之後是做出來的對吧
但會考前的更新是有點可憐就是了💩
接下來過完寒假，會考剩最後100天了，變成快死了的會考牲 🤡

然後啊 三月 四月 好像沒有什麼東西。喔對 你有做畢冊欸，好看
雖然中間幹事聽說挺多 但好看 :D
五月，我也不知道有什麼，後來就會考了，會考那兩天，應該也是沒發生什麼，就是中午很難睡而已 :D 如果有應該是我忘了而已

後來會考完，大家都在玩手機 看電影 玩桌遊，說實在挺空虛的💩反正我是沒想到會考後會那麼無聊，然後不知不覺 就要畢業了
紅樓夢結束的那一刻 畢業紀念冊發下的那一刻，彷彿都在向我們說「能和同學相處的時間不多了，最後的這一點時光，好好珍惜」
""",
"""
雖然說 跟你認識了那麼久（小一開始？
真正熟的時間也從國二開始而已。半夜的一某、校車上的八卦、為了一些無謂的事情爭吵到半夜2.，這些點點滴滴，即使上了高中、大學，也會永存於我的心中（吧
現在看回之前的各種回憶，不管是開心、生氣，亦或是尷尬、厭惡，都是這段友誼中不可或缺的元素，我們之間的感情，我很喜歡
一起發瘋、一起打鬧，一起玩螢光棒、一起面對情緒，一起學習、一起玩你畫我猜，一起討論價值觀、一起在學校度過最後的時光，最後一起畢業，一切的一切都是那麼寶貴，卻又走得那麼快

認識你的這兩年，被大大小小的回憶填滿，也正因如此，這段友誼顯得格外珍貴，奈何時間不曾為誰停下腳步，再要好的朋友、再珍貴的友誼，在時間的面前不值一提，但也希望能在畢業後繼續一如既往地聯絡，不被地緣限制，不被時間支配，隨心所欲的聊天

畢業快樂，或許會考成績不盡理想，但成績並不代表一個人的成敗，希望你能在這之後，仍能保持現在這份心情，積極的面對每個挑戰，能夠面對自己的情緒

這段友誼，在我心中永遠保有一席之地，不論時間過了多久，這兩年發生的事情，是最讓我印象深刻，也讓我想好好保存在心中的，也希望之後我們都能在各自開闢的道路上，發光發熱。

最後，期望你能在喜愛的、擅長的事物上，找到自己的一席之地

學校將我們聚再一起，又將我們殘酷的打散，但或許幾年後的某天，你會偶然間想起我們在這段時間所經歷的，會再次點開這個程式，看看那時候的我們，到了那時候的我，是什麼樣的人呢？到了那時候的你，又會是什麼樣的人呢？

那就
先醬子唄
畢業快樂
🎓


24.6.16  香菇

"""
    ]
}
